import React, { useState } from "react";

let text = "ეს ამბავი 1941 წლის აგვისტოში დაიწყო და ზუსტად ორი წლისთავზე გათავდა. ომი სულ რაღაც ორი თვის გამოცხადებული იყო, მისმა სუსხმა რომ ჩვენს სოფელს მოაღწია. ასეა თუ ისე, შეძლებულ ცხოვრებას მიჩვეულმა გლეხმა უცებ ვერ აწონა ქვეყნად მომხდარი საშინელება, უცებ ვერ დააგდო ხელგაშლილი ცხოვრება და უკვე აგვისტოში, ბევრის ბეღელი, ჭური და სალარო დაცარიელებული აღმოჩნდა, ყოველ შემთხვევაში, ჩვენს ოჯახს ასე დაემართა. წყალმანკით დაუძლურებული და ძვალგაციებული ბაბუაჩემი სპირიდონი დღედაღამ ბუხართან იჯდა და მთელი ოჯახის სიმძიმე მე მაწვა კისერზე. სხვას რომ თავი დავანებოთ, მარტო ტყიდან შეშისა და ფიჩხის თრევას ვერ ვუთავდებოდი, რათა ძვალგაციებულ ბაბუას ბუხარი არ გაპარვოდა.";

const Tour = () => {
  const [show, setShow] = useState(false);

  return (
    <>
      <main style={styles.main}>
        {show ? text : text.slice(0, 150) + "..."}

        <span
          onClick={() => {
            setShow(!show);
          }}
          style={styles.span}>
          {show ? " Show less" : "Read More"}
        </span>
      </main>
    </>
  );
};
export default Tour;

let styles = {
  main: {
    width: "400px",
    border: "2px black solid",
    padding: "16px",
    margin: "100px auto 0 auto",
    backgroundColor: "#e5dede",
  },
  span: {
    color: "blue",
  },
};
