//      ,    ,
//   ,@▒▒╜  ╣▒║╖     ▄▓█████  ▐██████▄ ▐██▌  ██▓       ▄█████▌  ███████`
// ╓╣▒▒╜ @╝╣╖`╢▒▒╗   ███"---  ▐██▌-███` █▓█▄███▀      ▐██▌---   ███▌,,
// ╢▒▒╖  ╢╗@╝  ╢▒▒╝  ███  ███ ▐███████  ▄▓█▓▓█▄       ▐██▌ ▐██▌ ██████
//  ╙╢▒╢╖ ║╜,╢▒▒╝    ███▄▄███ ▐██▌--`  ▐██▌ ▐███ ▓███ ▐███▄███▌ ███▄▄▄▄
//    `╢▒╜  ╣▒╜       ▀▀▀▀▀▀▀ '▀▀`     '▀▀`  ▀▀▀ ╙▀▀▀   ▀▀▀▀▀▀  ▀▀▀▀▀▀▀
"use strict";

const data = [
  {
    image: "https://gpx.ge/root/img/writers/1.jpg",
    fullName: "ნოდარ დუმბაძე",
    review: [
      {
        book: "ჰელადოს",
        text: "მრგვალ მაგიდაზე აკვარიუმი იდგა და შიგ წყალმცენარეებსა, ლამაზ ნიჟარებსა და ქვებს შორის მარაოსავით ფარფლებგაშლილი ოქროს თევზები დასრიალებდნენ, თან პირს სასაცილოდ აფჩენდნენ და ჰაერის ბუშტებს უშვებდნენ. რატომღაც მომეჩვენა, რომ თევზებს სასტიკად შიოდათ...",
      },
      {
        book: "თეთრი ბაირაღები",
        text: "პატიმრის სიზმარი სამოთხეს უნდა ჰგავდეს. შიგ თორმეტ-თორმეტ ოქტავიანი იადონები უნდა გალობდნენ, სიზმარი ოცნება უნდა იყოს, ცისარტყელასავით ჭრელი და ლამაზი.\n- შენ რას იტყვი, შოშია?\nსიზმარში სატრფოს უნდა ხედავდე, ულამაზესს და შენს მკლავზე მონებივრეს,\n- რას იტყვი, შოშია?",
      },
      {
        book: "მე, ბებია, ილიკო და ილარიონი",
        text: "ჩემს სოფელს მარჯვნივ გუბაზოული ჩაუდის, მარცხნივ - ლაშის ღელე, რომელიც სავსეა კიბორჩხალებით, ღორჯოებით და შარვალაკაპიწებული ბიჭებით. გუბაზოულზე ხიდია გადებული, რომელსაც ბოგას ეძახიან. ყოველ გაზაფხულზე მოვარდნილ წყალს მიაქვს ხიდი და ჩვენ მხოლოდ ხიდის თავი გვრჩება.",
      },
    ],
  },

  {
    image: "https://gpx.ge/root/img/writers/2.jpg",
    fullName: "დავით კლდიაშვილი",
    review: [
      {
        book: "ტრაგედია უგმიროთ",
        text: "ნელა შემობრუნდა, უხმოთ მოშორდა მოხუც დედაკაცს - თავის ნათლიას, რომელიც გულში ფიქრობდა: შენი მტერია, ეს ნახევარი ჯამი ფქვილი კი დავკარგე... მარა ჩემი რძალი მაინც არ გაიგებდეს... რას უშველის, საწყალს, ნახევარი ჯამი?.. ეხ, ღმერთო, ღმერთო!",
      },
    ],
  },
  {
    image: "https://gpx.ge/root/img/writers/3.jpg",
    fullName: "მიხეილ ჯავახიშვილი",
    review: [
      {
        book: "ჯაყოს ხიზნები",
        text: "ისევ დღე დღეს მისდევდა, კვირას - კვირა, წელიწადს - წელიწადი. თეიმურაზი კი მუდმივ სასწაულს ელოდებოდა. და სასწაულის მოლოდინში, მამულის დაბრუნებისა და ხელახალ გამდიდრების იმედიანობაში ნელ-ნელა დაილივნენ და დაცალიერდნენ თეიმურაზის გულიც, იმედებიც, წიგნსაცავიც და ბინაც.",
      },
    ],
  },
  {
    image: "https://gpx.ge/root/img/writers/4.jpg",
    fullName: "იაკობ გოგებაშვილი",
    review: [
      {
        book: "მკვეხარა ქოთანი",
        text: "ქოთნები ერთად შეგროვილიყვნენ. ერთი უფრო მაღლი ქოთანი შუაში ჩამდგარიყო და იკვეხნიდა: მე თქვენისთანა როდი ვარ, მე ოქროს ძირი მაქვსო. უცებ თავს წაადგა ციცხვი. - ერთი ამას დამიხედეთ, მე მაინც ხომ ვიცი რა ოქროს ძირიც გაქვსო! მკვეხარა ქოთანს შერცხვა და ხმა გაკმინდა.",
      },
    ],
  },
  {
    image: "https://gpx.ge/root/img/writers/5.jpg",
    fullName: "ლუკა რაზიკაშვილი",
    review: [
      {
        book: "ამოდის, ნათდება!",
        text: "ერთ წამში გათავდა ტოტიას სიცოცხლე; ლეშთან ერთად გათავდა მისი სულიც. ბეწვიც აღარსად ეგდო იმის მრავალტანჯულის ტყავისა. ოდნავ თუ სადმე ნასისხლარს შეამჩნევდით, ის იყო. მგლებს ცოტათი გული დაუმშვიდდათ, მაგრამ კიდევ შიოდათ. შეხედეს ერთმანეთს, შეეშინდა ერთს მეორისა, ალბათ იმიტომ - ახლა მე არ შემჭამონო. შეეშინდათ და გაფრთხენ. ერთი მეორეს გაურბოდა, ჯაგიანებში ჩხლაკა-ჩხლუკი ისმოდა და თან თოვლის ჭყრიალი...",
      },
    ],
  },
  {
    image: "https://gpx.ge/root/img/writers/6.jpg",
    fullName: "აკაკი წერეთელი",
    review: [
      {
        book: "ბაში-აჩუკი",
        text: "აბდუშაჰილისათვის ყველგან ბაღდადი იყო, სადაც კი მისი სატრფო იქნებოდა; სიყვარულით გამსჭვალულ პირიმზისას ეჩქარებოდა, რომ სამშობლოში გადაეტანა თავისი ბედნიერება; და ბაში-აჩუკს კი მაინცდამაინც მაგდენად არაფრად ეპიტნავებოდა იმერეთი, რადგანაც გაიგო, რომ მისი კახეთისაკენ გადავარდნის მიზეზი რაჭის ერისთავისათვის მიუთხოვებიათო.",
      },
    ],
  },
  {
    image: "https://gpx.ge/root/img/writers/7.jpg",
    fullName: "ილია ჭავჭავაძე",
    review: [
      {
        book: "კაცია ადამიანი?",
        text: "ხშირად შუაღამემდინ ცოლ-ქმარნი გაცხარებულნი და გაჭარხლებულნი ამისთანა ღრმა აზრებს ამტკიცებდნენ: „დღეს რა ვჭამოთ“, - იტყოდნენ დილით. „ხვალ რა ვჭამოთ“, - იტყოდნენ საღამოზედ. ეს იყო იმათი სულის საზრდო, ეს იყო იმათი გონების ვარჯიში, ეს იყო იმათი აზრის აღებ-მიცემა.",
      },
    ],
  },

  {
    image: "https://gpx.ge/root/img/writers/8.jpg",
    fullName: "გურამ დოჩანაშვილი",
    review: [
      {
        book: "კაცი, რომელსაც ლიტერატურა ძლიერ უყვარდა",
        text: "- ვინ და ბეტანკური, აბა აურელიანო-სქელს ხომ არ... - და შუბლზე შემოირტყა ხელი, - უჰ, აქამდე როგორ ვერ მივხვდი - თქვენ ძალიანა ჰგავხართ აურელიანო-სქელს, სანამ გასუქდებოდა, - და გაიოცა: - ბიჭო, ბიჭო, როგორა ჰგავს?!\n- ვინ სქელს, რა სქელს... - ავღელდი მე.",
      },
    ],
  },

  {
    image: "https://gpx.ge/root/img/writers/9.jpg",
    fullName: "ერიკ რასელი",
    review: [
      {
        book: "და არავინ დარჩა მეტი",
        text: "– ძალიან კარგი. გიჟურ სიტუაციაში აღმოვჩნდით და გამოსავალიც გიჟური უნდა მოვნახოთ. თქვენს შესაძლებლობასა და მზადყოფნაზეა დამოკიდებული იმპერიის ბედი. გამიგეთ?\n– დიახ, სერ, – უპასუხა ჰარისონმა, რომელმაც ვერაფერი გაიგო.",
      },
    ],
  },
];

let image = document.querySelector(".image");
let novel = document.querySelector(".novel");
let author = document.querySelector(".author");
let review = document.querySelector(".review");
let counter = 0;
//||||||||||||||||||||||||||||||||||||||||||||||||||
//||||||||||||||| Main Function ||||||||||||||||||||
//||||||||||||||||||||||||||||||||||||||||||||||||||
function cardSwitcher() {
  counter++;
  resetCounter();
  author.textContent = data[counter].fullName;
  //as writer can have several reviews, random is required
  let randomForReview = RandomNumber(data[counter].review.length);
  review.textContent = data[counter].review[randomForReview].text;
  novel.textContent = data[counter].review[randomForReview].book;
  image.style.backgroundImage = "url('" + data[counter].image + "')";
}

setInterval(cardSwitcher, 3000);
//||||||||||||||||||||||||||||||||||||||||||||
function RandomNumber(n) {
  return Math.floor(Math.random() * n);
}
//||||||||||||||||||||||||||||||||||||||||||||
function resetCounter() {
  if (counter > data.length - 1) {
    counter = 0;
  }
}
//||||||||||||||||||||||||||||||||||||||||||||
